backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def create
        @user = User.create(user_params)

UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "testwork"], ["password_digest", "$2a$12$X9x8ItpCaf8ByyBs3YcAQem8PKtw2vGXxFoO7UDZfbV9pM3gcKqd."], ["updated_at", "2019-10-15 22:03:55.472965"], ["id", 7]]
---
    def update
        unless @user.update(user_params)

DELETE FROM "user_animals" WHERE "user_animals"."id" = ?  [["id", 7]]
---
    def remove_animal
        @user = User.find_by(params[:id])
        @user.animals.destroy(params[:animal_id])

INSERT INTO "user_animals" ("user_id", "animal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 8], ["animal_id", 8], ["created_at", "2019-10-16 20:30:35.514480"], ["updated_at", "2019-10-16 20:30:35.514480"]]
---
    def add_animal
        @user_animal = UserAnimal.create(user_animal_params)

SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def find_user
        @user = User.find_by!('username': params[:_username])